import itertools


ans = '''ИВБО-10-23
ИВБО-11-23
ИВБО-12-23
ИВБО-13-23
ИВБО-20-23
ИВБО-21-23
ИВБО-22-23
ИКБО-10-22
ИКБО-10-23
ИКБО-11-23
ИКБО-12-23
ИКБО-13-23
ИКБО-14-23
ИКБО-15-23
ИКБО-20-23
ИКБО-21-23
ИКБО-22-23
ИКБО-24-22
ИКБО-34-22
ИКБО-40-23
ИКБО-41-23
ИКБО-42-23
ИКБО-43-23
ИКБО-50-23
ИКБО-51-23
ИКБО-52-23
ИКБО-60-23
ИКБО-61-23
ИКБО-62-23
ИКБО-63-23
ИКБО-64-23
ИКБО-65-23
ИКБО-66-23
ИКБО-67-23
ИКБО-68-23
ИКБО-70-23
ИКБО-71-23
ИКБО-72-23
ИКБО-73-23
ИКБО-74-23
ИКБО-75-23
ИКБО-76-23
ИМБО-10-23
ИМБО-11-23
ИНБО-10-23
ИНБО-11-23
ИНБО-12-23
ИНБО-13-23
ИНБО-20-23
ИНБО-21-23
ИНБО-22-23
ИНБО-23-23
ИНБО-30-23
ИНБО-31-23
ИНБО-32-23
ИНБО-33-23'''
ans = ans.split("\n")

def generate_groups():
    info = [["В", 4, 3], ["К", 6, 3, 0, 4, 3, 9, 7], ["М", 2], ["Н", 4, 4, 4]]
    groups = [f"И{g[0]}БО-{i + 1}{n}-23" for g in info for i, e in enumerate(g[1:]) for n in range(e)]
    return sorted(groups + ["ИКБО-10-22", "ИКБО-24-22", "ИКБО-34-22"])


a = generate_groups()
print(a)
print(ans)
for i in range(len(a)):
    assert(a[i] == ans[i])
